package main

import (
	"crawl_html_from_dc/services/get_response_html"
	"encoding/json"
	"fmt"
	"github.com/panwenbin/ghttpclient"
	"github.com/panwenbin/ghttpclient/header"
	"io/ioutil"
	"strings"
	"time"
)

type Send struct {
	Url    string `json:"url"`
	Header Header `json:"headers"`
}

type SendResponse struct {
	Msg string `json:"msg"`
}

type Receive struct {
	Url string `json:"url"`
}

type ReceiveResponse struct {
	Code int    `json:"code"`
	Msg  string `json:"msg"`
	Err  string `json:"err"`
	Data struct {
		Status int    `json:"status"`
		Msg    string `json:"msg"`
		Rdata  string `json:"rdata"`
	} `json:"data"`
}

type Header struct {
	Cookie    string `json:"cookie"`
	UserAgent string `json:"user_agent"`
}

//var htmlPath = "./data/html/%s.html"  // 和rank_task相同的生成cookie和ua的方法  -- 1000条数据，959个验证码
//var htmlPath = "./data/html2/%s.html" // 固定的cookie和ua  -- 1000条数据， 0个验证码
//var htmlPath = "./data/html3/%s.html" // 和上面相同的ua，cookie只留前面的BAIDUID部分  -- 1000条数据，程序退出，收到735个文件，0个验证码
//var htmlPath = "./data/html4/%s.html" // 和上面相同的cookie，ua随机  -- 1000条数据，0个验证码
//var htmlPath = "./data/html5/%s.html" // cookie使用函数生成，ua固定  -- 1000条数据，900+条验证码
//var htmlPath = "./data/html_mobile/%s.html" // 移动端，cookie使用函数生成，ua固定  -- 1000条数据，xxx条验证码
//var htmlPath = "./data/html_mobile_2/%s.html" // 移动端，cookie使用函数生成，ua固定  -- 1000条数据，xxx条验证码
var htmlPath = "./data/html6/%s.html"

var receiveResults = make(map[string]*ReceiveResponse, 2000)

//var send_url = "http://127.0.0.1:9010/dc-send"
//var receive_url = "http://127.0.0.1:9010/dc-receive"

var send_url = "http://123.207.181.230:9010/dc-send"
var receive_url = "http://123.207.181.230:9010/dc-receive"

var basicBaiduPcUrl = "http://www.baidu.com/s?wd=%s"
var basicBaiduMobileUrl = "http://m.baidu.com/s?wd=%s"

var keywords3 = []string{
	"如何公司注册", "商标注册程序", "商标注册人", "公司代理注册费用", "注册公司营业执照", "商标注册查询网", "苏州公司注册", "代理记账的公司", "深圳工商注册网站", "注册公司怎么办", "深圳市工商注册", "公司网上注册", "新注册的公司", "新公司注册流程", "深圳注册", "注册商标网", "苏州代办注册公司", "企业商标", "注册公司流程及费用", "上海注册公司服务", "上海工商代理注册公司", "个人商标注册", "上海注册公司代办公司", "商标代理", "上海注册公司流程", "注册公司咨询电话", "深圳代理记账", "上海工商注册网", "记账代理公司", "免费注册公司", "代理注册公司收费", "商标费用", "企业登记代理", "代理做账", "如何注册有限公司", "上海工商注册代理", "深圳工商", "注册公司电话", "上海自贸区注册公司", "代办公司", "注册贸易公司", "公司记账", "怎么在网上注册公司", "注册公司办理流程", "商标代理公司", "香港公司注册", "注册外资企业", "公司注册名", "注册公司要什么", "个体工商注册", "国际注册商标", "注册公司多少钱", "注册外资公司", "商标查询注册", "上海开公司代理", "注册公司时间", "咨询公司怎么注册", "商标注册查询官网", "如何申请注册公司", "办理公司注册手续", "深圳代理公司注册", "注册公司的费用及流程", "注册公司查询", "最新注册公司", "商标注册费", "海外商标注册", "代理商标注册", "注册企业流程", "代理注册公司可信吗", "外资注册", "商标流程", "代理公司记账", "深圳企业注册", "代办注册", "上海注册公司查询", "集团公司注册", "企业名称注册", "logo注册流程", "商标注册代理查询", "代理注册公司合法吗", "公司商标注册费用", "查询注册商标", "注册商贸公司", "办公司流程", "注册查询商标", "注册公司需要的材料", "代理记账代理", "注册公司代办收费", "商标注册个人", "公司注册商标查询", "注册公司需要什么", "注册上海公司流程", "注册香港公司", "注册公司需要什么条件", "企业设立流程", "国内商标注册", "商标在哪里注册", "注册公司需要多少钱", "商标怎么注册", "新注册公司流程", "注册代理记账公司", "深圳工商局", "商标注册分类", "注册商标的费用", "怎么申请商标", "版权登记", "香港注册公司", "查注册公司", "代办注册公司收费", "公司商标", "苏州代理记账", "上海代理公司", "注册公司名字", "中国商标注册网", "如何注册商标", "上海商标注册公司", "申请商标流程", "注册商标流程及费用", "商标注册多少钱", "注册商标流程", "工商注册的流程", "上海注册公司名称", "注册公司的具体流程", "工商注册代理记账", "申请商标", "工商代理注册", "商标注册查询网站", "国家商标注册", "商标注册收费", "代理记账平台", "代理记帐公司", "上海注册外贸公司", "商标注册的流程", "外资企业注册", "记账公司", "商标注册时间", "公司注册名称", "苏州代办公司注册", "公司注册找谁", "工商注册咨询", "上海公司注册费用", "注册海外公司", "如何申请商标", "开公司流程及费用", "注册公司要求", "商标申请费用", "代理记账注册", "公司名称商标注册", "工商代办", "商标申请注册流程", "工商注册服务", "如何在网上注册公司", "怎么办注册公司", "公司注册变更", "做账公司", "注册有限公司的流程", "注册公司查询网", "注册商标的流程", "商标申请流程", "美国商标注册", "公司注册时间", "深圳公司注册查询", "商标注册信息查询", "最新注册公司流程", "商标商标查询", "查询商标注册", "公司注册要多少钱", "企业变更", "深圳公司注销", "公司的注册资金", "怎样申请商标注册", "查公司注册", "上海注册公司多少钱", "查询商标", "专利申请", "企业注册名称", "上海代办公司", "上海注册公司哪家好", "做账报税", "代注册公司流程及费用", "深圳工商注册代理价格", "公司成立流程", "新公司注册代理公司", "商标注册官费", "企业注册时间", "商标注册办理", "怎么注册商标啊", "怎么申请商标注册", "公司办理", "闵行公司注册", "公司注册信息", "公司申请注册流程", "申请注册商标流程", "注册公司政策", "深圳市工商", "注册公司注意什么", "外贸公司注册流程", "深圳商标注册", "公司注册资料", "如何进行商标注册", "注册公司要多少钱", "公司注册地变更", "工商注册公司查询", "如何商标注册", "注销公司", "外资公司", "创业商标注册", "商标注册申请查询", "商标查询商标", "商标国际注册", "公司代办", "注册境外公司", "注册公司资料", "注册公司分类", "工商代理", "注册公司收费", "公司代办公司", "商标注册平台", "公司名字注册", "商标在那注册", "注册公司类型", "商标申请查询", "公司如何注册商标", "自己开公司流程", "注册外资", "公司名注册要求", "注册公司流程和费用", "注册公司需要多久", "公司注册地址变更", "深圳商标注册代理", "商标代理机构", "上海代理", "有限公司注册条件", "小公司注册流程", "商标注册需要多少钱", "申请公司流程", "深圳市公司注册查询", "工商注册地址", "营业执照注册", "注销企业", "上海注册公司费用", "上海闵行注册公司", "上海注册公司新政策", "代办", "国家商标注册网", "深圳注册公司新政策", "中国商标注册查询", "一般纳税人公司注册", "我要注册公司", "代办商标注册", "代帐公司", "快速注册公司", "开公司的流程", "香港注册公司流程", "注册深圳公司多少钱", "注册商标查询网", "深圳企业注册查询", "怎么查询注册商标", "外资企业", "深圳公司转让", "商标许可", "注册公司的条件", "企业商标查询", "个人公司注册流程", "注册自贸区公司", "国内商标", "申请工商注册", "上海公司代办", "公司名称注册查询", "注册公司需要提供的资料及公司注册流程", "怎么申请公司", "注册公司需要哪些材料", "申请注册公司流程", "上海外资公司注册", "注册商标查询", "代理公司注册机构", "上海注册商标", "红盾网公司注册", "公司代账", "注册独资公司", "注册变更", "中国商标注册网查询", "如何注册商标品牌", "商标注册网上申请", "注册中国商标", "全国商标注册查询", "网上公司注册", "国外注册公司", "怎样注册商标", "注册外贸公司", "办理公司的流程", "注册公司需要什么资料", "注册品牌查询", "苏州工商注册", "香港公司注册流程", "深圳网上注册公司流程", "怎么查商标", "网上商标注册流程", "注册公司新政策", "国家商标查询", "快速注册商标", "工商注册条件", "商标注册证查询", "商标查询系统", "商标查询网", "深圳注册香港公司", "自己如何注册商标", "深圳商标注册公司", "上海公司注册地址", "工商商标注册查询", "注册商标需要什么", "如何申请商标注册", "如何查询注册公司", "工商个体户注册", "商标注册专利申请", "外资企业工商注册", "注册代理机构", "网上注册商标", "记帐公司", "注销公司的流程", "深圳工商局注册公司查询", "怎么注册商标", "深圳市工商注册查询", "上海浦东注册公司", "公司注册机构", "注册公司需要哪些资料", "公司注销程序", "深圳工商网站", "国家商标注册查询", "怎样申请注册公司", "深圳注册公司多少钱", "logo查询", "什么是商标注册", "中国注册商标查询", "海外注册公司", "上海商标注册代理", "工商注册地", "上海浦东公司注册", "深圳在哪里注册公司", "商标怎么申请", "上海注册香港公司", "个人怎样注册商标", "注册设计公司", "注册分公司办理流程", "注册公司资本", "注册分公司流程", "北京商标注册代理", "代理记账公司注册条件", "注册公司代办需多少钱", "个人注册公司流程", "商标查询查询", "怎样注册投资公司", "公司注册核名", "上海注册公司代理公司", "商标名称注册查询", "公司地址变更流程", "商标网商标查询", "注册公司麻烦吗", "注册个公司要多少钱", "公司注销的流程", "代理记账公司成立条件", "查询企业注册", "查商标有没有注册", "代办工商注册", "注册投资公司", "国家商标注册查询网", "注册商标类别", "工商地址变更流程", "科技公司注册流程", "上海注册公司优惠政策", "国家商标官网", "浦东公司注册", "代办代理工商注册", "深圳市注册公司流程", "变更公司注册地址", "代注册", "办理公司流程", "个体工商户注册", "商标注册证查询网", "注册公司需要的资料", "查询商标网", "工商注销流程", "公司记账报税", "上海代理记账公司排名", "注册公司需要什么东西", "注册上海分公司", "公司注销流程", "注册地址变更", "工商注册信息", "代注册公司多少钱", "工商办理", "公司注销步骤", "企业注册信息", "商标注册类别大全", "上海代理记账", "商标查寻", "怎样查询注册商标", "企业登记注册", "注册美国公司", "国内商标查询网站", "商标注册类别", "怎么查询商标", "网上怎么注册公司", "中国商标网", "国际商标注册公司", "注册小公司要多少钱", "商标查询怎么查", "营业执照代办", "怎么注册公司呢", "公司注册地址查询", "注册外资公司流程", "商标如何注册", "商标怎么查", "注册公司名查询", "公司注册注意事项", "北京商标注册", "深圳公司注册新政策", "代理记账流程", "企业工商注册查询", "香港注册公司代理", "商标专利申请", "代记账公司", "商贸公司注册流程", "外资注册流程", "注册公司香港", "商标网查询", "企业营业执照办理", "公司注册类型", "公司代办需要多少钱", "贸易公司注册流程", "个人商标注册流程", "个体户工商注册", "注册商标查询官网", "公司名注册查询", "注册品牌流程及费用", "商标注册机构", "注册公司要多久", "商标注册申请书", "合资注册公司", "代理注册香港公司", "公司工商", "企业注册资金", "如何变更公司注册地址", "深圳公司网上注册", "商标在哪注册", "注册一个公司多少钱", "深圳工商局网站", "投资公司怎么注册", "商标注册要求", "上海公司注册查询", "注册流程", "代办公司注册多少钱", "商标服务", "合资企业注册", "商标版权", "园区注册公司", "中外合资企业注册", "上海商标注册", "公司注册材料", "注册商标多少费用", "浦东注册公司", "公司注册需要多少钱", "中国商标", "代理营业执照", "商标检索查询", "工商注册网站", "工商公司", "全国商标查询网", "外资企业注册流程", "公司注销手续", "开办公司流程", "上海工商注册查询", "注册公司都需要什么", "北京代理注册公司", "集团公司如何注册", "注册商标分类", "深圳公司注册费用", "注册一般纳税人公司", "注销公司办理", "公司注销费用", "中国企业商标网", "注册商贸公司流程", "商标续展费用", "注册公司的经营范围", "外商注册公司", "深圳工商注册查询网", "注册品牌商标多少钱", "代办公司注册机构", "商标官费", "记账报税", "查商标网", "如何注册一个公司", "工商公司注册查询", "注册商标的条件", "公司注册经营范围", "开公司的好处", "中国商标查询网", "深圳代办营业执照", "注册分公司流程及费用", "公司关闭流程", "查商标的网站", "注册公司哪家好", "国家商标", "商标免费查询", "深圳代理记帐", "注册公司苏州", "公司地址变更", "如何注销公司流程", "注册查询", "小规模公司注册", "深圳市工商登记注册", "注册商标需要什么条件", "代办深圳营业执照", "如何申请注册商标", "深圳如何注册公司", "代理注册工商", "注册工商", "代账公司", "注册广告公司", "企业注册地址变更", "商标查询网站", "深圳公司变更", "企业工商注册信息", "外国公司注册", "个人怎样申请商标", "怎样注册公司流程", "新开公司注册的流程", "上海记账公司", "中国商标注册查询网", "商标检索网", "注册外贸公司流程", "工商注册网", "公司怎么报税", "代理记帐", "网上商标查询系统", "企业注销程序", "工商商标", "上海注册公司要多少钱", "注册公司没有地址", "个人工商注册", "商标搜索", "上海外资注册", "商标驳回", "个人注册商标流程", "上海工商企业信息查询", "商标的分类", "注册公司名称查询", "代理记账怎么收费", "互联网注册公司", "分公司注册流程", "苏州商标注册", "个人能不能注册商标", "企业注册核名", "工商注册资金", "在线注册公司", "在香港注册公司", "企业注册查询", "记账", "怎样注册新公司", "马德里商标注册", "境外公司注册", "注册新公司名称", "商标类别", "工商注册地址要求", "深圳注册公司新规定", "商标注册号是什么", "上海企业信息查询", "北京商标注册公司", "公司销户", "企业变更地址", "上海代理记账公司", "国家商标网查询", "新公司注册资金", "财税代理", "注册小公司流程", "个人怎么注册商标", "香港公司注册深圳", "免费查询商标", "上海商标注册局", "怎么注册品牌", "国家商标注册总局", "查企业注册", "深圳营业执照办理", "马德里商标", "深圳注册公司条件", "公司注册网上申请", "外资注册代理", "工商注册咨询电话", "独资企业注册", "公司注册转让", "公司流程", "注册公司有什么好处", "自贸区注册公司", "商标备案", "注册个体工商户", "注册成立公司的流程", "中国商标查询系统", "商标注册要多少钱", "公司网址怎么注册", "报税公司", "企业营业执照代办", "企业经营范围变更", "工商变更代理", "北京代办注册公司", "注册小规模纳税人公司", "注册地变更", "企业登记注册网", "商标如何申请", "品牌名称注册查询", "版权查询", "公司注册哪家好", "如何查询已注册商标", "品牌怎么注册", "注册小规模纳税人", "外资公司注册条件", "会计记账代理", "深圳市工商局网站", "自贸区内注册公司", "深圳注销公司", "贸易公司注册条件", "注册公司成本", "注销公司流程", "中国商标网商标查询", "商标查询官网", "注册公司的好处", "注册公司条件", "如何注册子公司", "注册集团", "免费商标查询", "公司申请流程", "商标注册分类表", "深圳工商网", "公司名称注册查询网", "网上注册公司流程", "公司注册要求", "上海代办", "公司注册资金", "香港公司注册代理", "深圳代理记账公司", "代办注册地址", "网络公司注册流程", "商标可以个人注册吗", "深圳工商注册查询", "商标注册号是哪个", "商标续展", "申请商标多少钱", "深圳工商变更", "己注册商标查询", "工商注册登记流程", "上海工商局网站", "深圳营业执照代办", "国家商标查询系统", "已注册商标查询", "深圳公司转让网", "子公司注册", "上海工商网", "注册新公司的流程", "开曼公司注册", "上海工商网站", "商标续展流程", "上海工商所", "电商公司注册", "深圳分公司注册", "注册公司起名", "上海奉贤注册公司", "公司注册法", "商标专利查询", "企业地址变更", "工商注册网查询", "分公司注册条件", "虚拟地址注册公司", "商标驳回复审", "中国商标查询", "产品注册商标查询", "如何注册商标名称", "中外合资公司注册", "图形商标注册要求", "工商注册查询网", "公司费用", "商标网商标查询官网", "没有注册的商标", "cn注册", "注册经营范围", "怎样去注册商标", "苏州代账公司", "免费注册公司网站", "新注册公司名称查询", "注销公司流程及费用", "版权登记查询", "注册公司地址要求", "注册商标名字", "注册公司税务怎么办理", "企业变更法人流程", "如何注册进出口公司", "注册公司核名", "中国商标网查询", "注销公司费用", "开公司要多少钱", "闵行区注册公司", "免费工商注册", "工商执照注册", "注册名称查询", "深圳网上办理营业执照", "服务商标", "金山注册公司", "如何注册香港公司", "公司变更地址流程", "注册bvi公司", "离岸公司注册", "商标代理机构查询", "上海企业注册查询", "深圳转让公司", "英国注册公司", "怎样注册商标名", "深圳注册商标", "版权登记流程", "注册公司需要什么材料", "商标注册证", "注册香港公司费用", "怎么注册一个公司", "商标注册网上申报", "开公司需要多少钱", "国家商标网", "怎么注册品牌商标", "办工商执照", "商标注册号", "闵行注册公司", "查询商标是否已注册", "商标注册美国", "注册公司需要多少费用", "公司注销的费用", "商标咨询", "上海市工商网", "济南商标注册", "注册一个小公司", "代办公司变更", "工商注册名称查询", "商标注册号查询", "企业logo注册", "商标变更", "营业执照网上注册", "中国国家商标网查询", "企业注销流程", "办公司需要多少钱", "服装商标注册", "深圳公司注销代办", "办公司营业执照", "注销公司的流程及费用", "国家工商商标网", "怎样注册品牌商标", "bvi公司注册", "变更经营范围", "上海公司", "工商营业执照", "北京公司注册", "商标查询在哪里", "公司注册所需材料", "商标续展时间", "商标注册号在哪里看", "深圳企业注销", "工商企业注册查询网", "注册公司转让", "深圳财务代理公司", "北京注册公司代办", "商标类型", "代办公司执照", "注册小规模公司", "工商注册查寻", "注册商标转让", "商标注册名字", "商标设计注册", "代理记账的收费标准", "上海注册公司的流程", "上海工商局查询", "新公司注册代办", "注册商标是什么", "logo注册商标", "在哪里注册公司", "公司的营业执照", "企业地址变更流程", "网上注册公司怎么注册", "注册小公司需要多少钱", "食品商标注册流程", "国家商标查询网", "公司经营范围变更", "上海工商企业查询网", "上海企业名称查询", "营业地址变更流程", "商标注册种类", "企业注册登记信息", "注册一个公司的流程", "深圳市红盾网", "商标注册费用多少", "上海工商登记查询", "商标在线查询", "财税服务", "上海工商企业查询", "北京公司注册代理", "变更公司地址", "商标注册转让", "注册公司需要些什么", "怎么注册个体工商户", "认缴制注册公司", "深圳工商咨询电话", "奉贤注册公司", "公司logo注册流程", "中国商标注册管理局", "公司注册资本", "上海工商网企业查询", "天津商标注册", "外商独资企业注册", "查工商注册", "网上可以注册公司吗", "上海工商年检网", "苏州企业注册", "商标注册方案", "食品公司注册", "上海域名注册", "商标注册总局", "注册公司挂靠", "公司变更法人流程", "著作权查询", "商标复审成功率", "注册工商营业执照", "上海工商官网", "深圳工商查询", "企业法人变更", "如何查询商标", "公司logo注册", "商标官网查询", "商标注册局", "注册子公司流程", "注册一家公司要多少钱", "企业注册资本", "法人变更", "个人可以申请商标吗", "网上怎么注册商标", "商标45大类明细", "网络科技公司注册", "注册企业查询", "上海企业", "新公司工商注册", "公司营业执照", "香港公司注册网", "怎么注销公司", "深圳工商登记查询", "商标名字查询", "深圳办理营业执照", "如何注册品牌", "上海公司查询", "代理注销公司", "美国商标查询", "注册一人公司", "工商企业注册查询", "如何查询注册商标", "商标驳回复审费用", "商标复审费用", "深圳公司买卖", "食品商标注册", "商标查询网官网查询", "财务代理记账", "开曼注册公司", "申请公司营业执照", "商标分类", "代办工商", "深圳商标申请", "公司名称注册标准", "商标数据库", "个体营业执照注册", "上海市工商局企业查询", "注册开曼公司", "公司注册查询网", "工商注册经营范围", "代理记账公司都做什么", "工商注册费用是多少", "注册有限公司的条件", "企业注销", "公司执照代办", "美国商标", "变更法人流程", "注册公司名称要求", "注册公司要哪些条件", "变更法人", "正规注册公司", "商标可以转让吗", "合资企业注册流程", "公司怎么注销", "开办代理记账公司", "商标注册分类明细", "企业变更注册地址", "重庆商标注册", "注销分公司", "中国商标官网", "商标转让", "商标网官网", "注册子公司", "代理记账公司收费", "公司名称注册要求", "公司注销流程及费用", "公司执照注销", "办理分公司流程", "注册商标要多少钱", "商标注册需要的材料", "个人如何注册公司", "公司更换法人", "上海财务代理记账", "新注册公司费用", "小公司注销流程及费用", "注册广告公司流程", "深圳注销公司流程", "法人变更流程", "注册香港公司流程", "代办工商执照", "变更注册", "深圳营业执照办理流程", "logo注册查询", "国家商标局商标查询", "网上申请注册公司", "注册外国公司", "网上工商注册", "公司法人变更代办", "注销企业流程", "公司工商注销流程", "注册浦东公司", "上海商标代理", "企业变更法人的流程", "公司注册范围", "一人注册公司", "商标注册证号查询", "注册香港公司多少钱", "个人怎样注册公司", "执照注册", "注册公司法人", "如何注册小公司", "美国公司注册", "公司注册名查询", "异地注册公司", "商标证书", "虚拟注册地址", "个体户注册", "公司做账流程", "注册商标步骤", "法定代表人变更程序", "我想注册公司", "香港注册公司的好处", "版权注册", "商标名称查询", "上海公司注销", "变更股权", "电子商务公司注册", "中国商标网官网", "公司注册号", "代办工商变更", "转让注册商标", "营业执照办理", "专利权查询", "深圳市企业注册局", "商标备案查询", "商标注册需要多久", "中外合资公司注册流程", "网上申请商标", "崇明公司注册", "进出口公司注册条件", "工商注册查询网站", "发明专利申请", "注册公司取名", "北京注册公司", "查看商标是否被注册", "深圳公司", "上海工商网查询", "查询公司注册信息", "注册法国商标", "商标受理查询", "香港商标", "公司注册网上核名", "怎么查商标是否注册", "注册公司核名查询", "商标注册要多长时间", "商标买卖网站", "税务代办公司", "个人独资企业注册", "上海企业网站", "驳回复审", "注册公司名字查询网", "商标综合查询", "马德里商标注册费用", "代办公司注销", "商标注册多久", "公司不注销", "上海注册公司注册资金", "如何注册贸易公司", "个体工商户怎么注册", "企业法人变更流程", "工商注册查询", "工商登记注册流程", "工商营业执照办理流程", "深圳工商局注册查询", "注册公司核名网站", "代理记账公司简介", "一人有限公司注册",
}

func main() {
	keywords3 = keywords3[0:50]

	send()

	i := 1
	for len(keywords3) > 0 {
		receive()
		unAccomplishKeywords := []string{}
		for keyword := range receiveResults {
			switch receiveResults[keyword].Code {
			case 201: // 任务正在查询
				fmt.Println((keyword), "任务正在查询")
				unAccomplishKeywords = append(unAccomplishKeywords, keyword)
			case 400: // 访问此接口时参数格式不正确
				fmt.Println("访问此接口时参数格式不正确")
			case 300: // 下载中心暂时没有此任务
				fmt.Println((keyword), "接收为空")
				if i >= 2 {
					reSend(keyword)
				}
				unAccomplishKeywords = append(unAccomplishKeywords, keyword)
			case 500, 501: // 从结果提取rData结构的map出错 // 从下载中心接口取结果出错
				fmt.Println((keyword), "接收为空")
				unAccomplishKeywords = append(unAccomplishKeywords, keyword)
			case 502:
				fmt.Println("Status is neither 1 nor 2, dcResponse:", receiveResults[keyword])
				unAccomplishKeywords = append(unAccomplishKeywords, keyword)
			case 200: // 获取结果成功
				fmt.Println((keyword), "接收成功")
				rDataMap, err := get_response_html.ResponseRDataMap(receiveResults[keyword].Data.Rdata)
				if err != nil {
					fmt.Println("Html ResponseRDataMap error:", err)
					unAccomplishKeywords = append(unAccomplishKeywords, keyword)
					continue
				}

				html, err := get_response_html.DecodeHtml(rDataMap)
				if err != nil {
					fmt.Println("Html DecodeHtml error:", err)
					unAccomplishKeywords = append(unAccomplishKeywords, keyword)
					continue
				}

				if strings.Contains(html, "百度安全验证") {
					writeHtml("验证码_"+keyword, html)
				} else {
					writeHtml(keyword, html)
				}
			}

			//if receiveResults[keyword].Err != "" {
			//	if strings.Contains(receiveResults[keyword].Err, "下载中心的下载队列中暂时没有该任务") {
			//		if i >= 2 {
			//			reSend(keyword)
			//		}
			//	}
			//	fmt.Println((keyword), "接收为空")
			//	unAccomplishKeywords = append(unAccomplishKeywords, keyword)
			//} else {
			//	if receiveResults[keyword].Data.Rdata == "" {
			//		unAccomplishKeywords = append(unAccomplishKeywords, keyword)
			//		fmt.Println((keyword), "接收为空")
			//		continue
			//	}
			//
			//	fmt.Println((keyword), "接收成功")
			//
			//	rDataMap, err := get_response_html.ResponseRDataMap(receiveResults[keyword].Data.Rdata)
			//	if err != nil {
			//		fmt.Println(err)
			//		unAccomplishKeywords = append(unAccomplishKeywords, keyword)
			//		continue
			//	}
			//
			//	html, err := get_response_html.DecodeHtml(rDataMap)
			//	if err != nil {
			//		fmt.Println(err)
			//		unAccomplishKeywords = append(unAccomplishKeywords, keyword)
			//		continue
			//	}
			//
			//	if strings.Contains(html, "百度安全验证") {
			//		writeHtml("验证码_"+keyword, html)
			//	} else {
			//		writeHtml(keyword, html)
			//	}
			//}

			time.Sleep(time.Millisecond * 200)
		}

		receiveResults = map[string]*ReceiveResponse{}
		keywords3 = unAccomplishKeywords
		fmt.Println("length unAccomplishKeywords:", len(unAccomplishKeywords), unAccomplishKeywords)
		i++
	}
}

func send() {
	for i, keyword := range keywords3 {
		var headers = getHeader()
		sendData := &Send{
			//Url: fmt.Sprintf(basicBaiduMobileUrl, keyword), // 移动端
			Url:    fmt.Sprintf(basicBaiduPcUrl, keyword), // pc端
			Header: *headers,
		}

		jsonBytes, _ := json.Marshal(sendData)
		sendResponse := &SendResponse{}
		err := ghttpclient.PostJson(send_url, jsonBytes, nil).ContentType("application/json").ReadJsonClose(sendResponse)
		if err != nil {
			fmt.Println(err)
		}

		fmt.Println(i, "/", len(keywords3), keyword, *sendResponse)
		time.Sleep(time.Millisecond * 200)
	}
}

func receive() {
	for i, keyword := range keywords3 {
		fmt.Println(i, "/", len(keywords3), keyword)

		receiveData := &Receive{
			//Url: fmt.Sprintf(basicBaiduMobileUrl, keyword),
			Url: fmt.Sprintf(basicBaiduPcUrl, keyword),
		}
		jsonBytes, _ := json.Marshal(receiveData)
		receiveResponse := &ReceiveResponse{}

		httpHeader := make(header.GHttpHeader)
		httpHeader.Set("Content-Type", "application/json")
		err := ghttpclient.PostJson(receive_url, jsonBytes, httpHeader).ReadJsonClose(receiveResponse)
		if err != nil {
			fmt.Println(keyword, err)
			fmt.Println()
		}

		receiveResults[keyword] = receiveResponse
		time.Sleep(time.Millisecond * 200)
	}
}

func writeHtml(keyword string, html string) {
	path := fmt.Sprintf(htmlPath, keyword)
	data := []byte(html)
	if ioutil.WriteFile(path, data, 0644) == nil {
		fmt.Println("写入文件成功:", keyword)
	}
}

func reSend(keyword string) {
	var headers = getHeader()
	sendData := &Send{
		Url:    fmt.Sprintf(basicBaiduMobileUrl, keyword),
		Header: *headers,
	}

	jsonBytes, _ := json.Marshal(sendData)
	sendResponse := &SendResponse{}
	err := ghttpclient.PostJson(send_url, jsonBytes, nil).ContentType("application/json").ReadJsonClose(sendResponse)
	if err != nil {
		fmt.Println(err)
	}
}

func getHeader() *Header {
	return &Header{
		Cookie: "BIDUPSID=5028A9DDCD923E023F0FEEC0B22370EB; PSTM=1568778486; BD_UPN=12314753; MSA_WH=1920_937; sug=3; sugstore=0; ORIGIN=0; bdime=0; BAIDUID=7F61C000432B074BB3F59CB59006AE37:SL=0:NR=50:FG=1; BDSFRCVID=Y7ksJeCCxG3eeVnwYW3JJmG-Mf_5_9f-jAK73J; H_BDCLCKID_SF=tJAHoKLaJC83H43TqRrEKtFD-frQ5C62aKDsQpQ7BhcqEIL406Ah2xku5NLJQJotLCcZ5tjafR7kMxbSj4QohtAJ5Goi2t4OW6kJ2hoX3p5nhMJS257JDMP0-xQEXqQy523i2IovQpnVfqQ3DRoWXPIqbN7P-p5Z5mAqKl0MLPbtbb0xXj_0D6J3eaLHJ58s56bL3RTsH4jaKROvhDTjh6PYjnn9BtQmJJufsCJ9LfbbhfobXnoGbxIYbf6EbRQqQg-q3R77fx8bSJ33M-vBKMuUe-jy0x-jLgbOVn0MW-5Dh4tl3-nJyUPTD4nnBPrt3H8HL4nv2JcJbM5m3x6qLTKkQN3T-PKO5bRu_CFbJKDhMKt9eno_Mt4HqfbQa4JWHDQbsJOOaCvESlQRy4oTLnk1DUo---6fyRRp2POIaKoqjpOSjxQGW5DjMt-eBjIHfnFJoKDytKvbfP0kb-oj-J0JhMnXetJya4o2WDvwJbv5OR5JLn7nDPL83xTfXl-eWeQLK56z5fAh_ITIqt6NyTbyyG62btt_JnPOoC3P; delPer=0; BD_CK_SAM=1; BD_HOME=0; COOKIE_SESSION=72215_0_8_4_6_29_0_0_4_7_1_0_0_0_3_0_1574837213_0_1574909473%7C9%23168427_6_1573711496%7C3; rsv_i=c5dcs%2B2Sxl6DOt%2B88XQMACsCEFy3GriRvwEmqRK4qMh9JCp5OBaxkiYkZjOf5BSV%2Bb5w%2FVEjI6yYDhJM5Si1%2FRqZmCJQ1h4; FEED_SIDS=418692_1128_16; H_WISE_SIDS=136721_138198_138180_134724_136758_114746_137657_135846_137970_120173_138489_137380_138002_137979_132910_137690_131247_132551_137745_136681_118886_118868_118850_118837_118803_107318_137174_136430_137734_133352_137900_136863_138148_136196_124624_137105_133847_138477_138343_137468_138032_131423_137703_110085_138548_127969_137830_138152_128195_136636_138425_138563_136719_138302_138074_100459; PSINO=5; BDORZ=B490B5EBF6F3CD402E515D22BCDA1598; H_PS_PSSID=1435_21087_30211_20883_30245_30071_26350_30191; SE_LAUNCH=5%3A26248849; H_PS_645EC=bd79iPlZ00IhK61mj9qNOD6a9ctDVhuNCqR0Cg3ErWY0jidVifGIxSujLws; BDSVRTM=154; WWW_ST=1575423521087",
		//Cookie:    "BAIDUID=" + utils.BaiduCookie(),
		UserAgent: "Mozilla/5.0 (iPhone; CPU iPhone OS 10_2 like Mac OS X) AppleWebKit/602.3.12 (KHTML, like Gecko) Mobile/14C92 MicroMessenger/6.5.9 NetType/WIFI Language/zh_CN",
	}
}
